In [1]:
import pandas as pd
age2_df = pd.read_csv('Dataset/age2.csv')
age2_df.head(6)

   Age  Degrees  Income
0   50        5    5000
1   60        3    4500
2   10        1    7000
3   20        2    6000
4   40        7    3500
5   80        9    2000

In [2]:
X = age2_df[['Age', 'Degrees']]
y = age2_df['Income']

In [3]:
X

   Age  Degrees
0   50        5
1   60        3
2   10        1
3   20        2
4   40        7
5   80        9

In [4]:
y

0    5000
1    4500
2    7000
3    6000
4    3500
5    2000
Name: Income, dtype: int64

In [5]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=10)

In [6]:
X_train

   Age  Degrees
0   50        5
3   20        2
4   40        7
1   60        3

In [7]:
X_test

   Age  Degrees
2   10        1
5   80        9

In [8]:
from sklearn.linear_model import LinearRegression
clf = LinearRegression()

In [9]:
clf.fit(X_train, y_train)

LinearRegression()

In [10]:
clf.predict(X_test)

array([6555.55555556, 2314.81481481])

In [11]:
clf.score(X_test, y_test)

0.9762688614540466

In [12]:
clf.coef_

array([ -20.37037037, -351.85185185])

In [13]:
clf.intercept_

7111.111111111111

In [14]:
clf.predict([[25, 2]])

C:\Users\arpit\Anaconda3\lib\site-packages\sklearn\base.py:451: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  "X does not have valid feature names, but"

array([5898.14814815])